/*逻辑运算*/

#include <stdio.h>

int main(){
    
    //“ ||”或“ && ”与(且) “ ! ”非

    //int a= 1>2||2>3;//有真为真
   // printf("%d\n",a);
    
    //int b=1<2&&2<3;//有假为假
    //printf("%d\n",b);
    
    //int c=!(1<2);//真假调换
   // printf("%d\n",c);
    
    //int a=0||1>2||2>1;
    //printf("%d\n",a);
    
    //如果||表达式左边表达式已经为真,则右边不执行.
    //int a=2;
   // int b=1<2||a++;
    //printf("a=%d b=%d\n",a,b);
    
    //而&&只要左边为假右边不执行.
    
   // int a=2;
    //int b=1<2&&a++;
    //printf("a=%d b=%d\n",a,b);
    
    //优先级顺序为：小括号() > 负号( -) > ! > 算术运算符 > 关系运算符 > && > ||
    int a=1+2<3||!-3<4&&5>0 ;
    printf("%d\n",a);
    
    return 0;
    
    
}

