/*循环控制语句for的用法*/
#include <stdio.h>

int main(){
    
    /*
     
    int a=0;
     
    while (a<10) {
        printf("当前是第%d行Hello world!\n",a);
        a++;
    }
     
     */
    
    
    /*
     for循环的组成.由三个语句+循环体
     
     for(语句1;语句2;语句3){
     
        循环体:需要反复执行的代码...
     
     }
     
     执行顺序:语句1-->判断语句2是否成立--成立-->循环体-->语句3-->判断语句2是否成立--成立-->循环体-->语句3-->再判断语句2...直到语句2不成立.for循环终止.
     
     1.for循环第一个语句:只会执行一次:一般用于初始化变量.且如果是定义同一类型的变量,可以定义多个.方法:int a=1,b=2;
     
     for (int a=0, b=2; a<10; a++) {
     
        printf("当前是第%d行Hello world!\n",a);
     }
     
     2.for循环第二个语句:是一个条件语句,控制for循环是否要继续执行.如果这个条件不满足,for循环结束了.
     注意:这个必须要有一个判断结果.如果为空,表示默认为真.则是死循环
     
     for (int a=0; ; a++) {
        printf("当前是第%d行Hello world!\n",a);
     }
     
     3.for循环第三个语句不一定会执行.一般用于控制循环增量或变化.
     注意:不能放变量定义语句.
     
     for (int a=0; a<10; int b=0) {
        printf("当前是第%d行Hello world!\n",a);
     }
     
     
     4.for循环的循环体:没有限制,可以放任意你想执行的语句.
     
     */
    
    
    
    /*
     
     循环嵌套.如果子循环本身定义了变量,用自已的.
     如果本身作用域没有定义变量,则会去上一层的作用域寻找,
     依次类推.(就近原则)
     
     */
    
    for (int a=0; a<2; a++) {
        
        for (; a<10; a++) {
            
            if(5==a){
                continue;
            }
            if (8==a) {
                break;
            }
            
            printf("当前是第%d行Hello world!\n",a);
        }
        
         printf("外循环当前是第%d行Hello world!\n",a);
        
    }
    
    
    //for循环中定义的变量,只在for循环中有效
    //printf("%d",a);
    
    return 0;
    
}
