/*for循环思考练习*/

#include <stdio.h>

int main(){
    
    /*
     
     1.请问break与continue有什么区别?
     
        1.break:可以用于swtich和while,do while和for循环
        但continue不能用于switch.
        2.break是结束当前switch或循环语句.
        continue是结束本次循环,继续判断执行下一次循环.
     
     相同点:在break与continue相同作用域下.二者下面都不能放代码.因为不会执行.还有二者都是关键字.
     
     */
    
    
    /*
     
     2.for语句与while语句可以互换吗?二者的相同点及区别是什么?
     
        1.可以互换.
        2.二者都是去根据条件反复执行相同的代码.
        3.区别是:二者结构用法不一样.
     
        while(条件判断){
        循环体...
        }
     
        do{
            循环体...
        }while(条件判断);
     
        for(语句1;语句2;语句3){
            循环体..
        }
     
     三个最简单的死循环的写法.
     while (1)
     ;
     do
     ;
     while (1);
     for (; ; )
     ;
     
     
    //如果省略{}.则下面不能定义变量.因为作用域不明确.
    for (int a=0; a<10; a++)
        int b=0;
        printf("hello\n");
     
     */
    
    
    /*
     ,逗号运算符可以用于一个语句之间.把一个语句分隔成几部分
     如:int a=0,b=0; 
     for循环的循环体定义的变量仅在循环体内有效.
     
    for (int i=0; i<10; i+=2,i++,a++) {
        int a=0;
        printf("hello\n");
    }
     */
    
    
    /*计算1+2+3+….+100的值(用for语句实现).
     
    int count=0;
     
    for (int num=1; num<=100; num++) {
        count+=num;
    }
     
    printf("1+2+3+….+100的值是%d\n",count);
     
     */
    
    
    /*
     打印一个九九乘法口诀表
     
     1*1=1
     1*2=2	2*2=4
     1*3=3	2*3=6	3*3=9
     1*4=4	2*4=8	3*4=12	4*4=16
     1*5=5	2*5=10	3*5=15	4*5=20	5*5=25
     1*6=6	2*6=12	3*6=18	4*6=24	5*6=30	6*6=36
     1*7=7	2*7=14	3*7=21	4*7=28	5*7=35	6*7=42	7*7=49
     1*8=8	2*8=16	3*8=24	4*8=32	5*8=40	6*8=48	7*8=56	8*8=64
     1*9=9	2*9=18	3*9=27	4*9=36	5*9=45	6*9=54	7*9=63	8*9=72	9*9=81
     
     多行多列的实现逻辑
     外循环控制行数
     内循环控制列数
     
     for (int a=1; a<=9; a++) {
     
        for (int b=1; b<=a; b++) {
     
            printf("%d*%d=%d\t",b,a,a*b);
        }
     
        printf("\n");
     }
     
     */
    
    
    /*
     
     打印下面图形
     
        *
       ***
      *****
     *******
     
     1 2 3 4
     4 5 6 7
     
     4星--->3空 1星--->a=0 b<3打空格
     5星--->2空 3星--->a=1 b<2打空格
     6星--->1空 5星--->a=2 b<1打空格
     7星--->0空 7星--->a=3 b<0打空格
     
     */
    
    for (int a=0; a<4; a++) {
        
        for (int b=0; b<=a+3; b++) {
            
            if(b<3-a){
                 printf(" ");
            }else{
                 printf("*");
            }
           
        }
        
        printf("\n");
        
    }
    
    return 0;
    
}



