
1.结构体是什么数据类型?
2.结构体里面的元素可以是不同类型吗?
3.结构体可以定义在什么位置?使用时遵循什么原则?
4.结构体类型可不可以重复定义?有没有例外?
5.结构体在函数内和在函数外生命周期一样吗?
6.结构体与数组有什么区别?
7.结构体数组是什么?
8.结构体指针取值有哪两种方式?
9.struct Person{char *name;char c;int age;};这个结构体在内存中占几个字节?写出理由.

编程题:
1.定义一个结构体,然后打印里面的每一个元素.(两种方式:结构体变量和指针)

2.用结构体定义一个三口之家.家里每个成员都有:姓名,年龄,身份(如:父亲).

3.打印这个三口之家的所有成员信息.

4.实现一个定义描述星期的枚举类型.并取周二的值.



1.什么是预处理指令?

2.C语言中的预处理指令有哪些?

3.预处理指令出现的意义是什么?

4.文件包含关键字是什么?核心作用是什么?

5.宏定义关键字是什么?核心作用是什么?

6.条件编译关键字是什么?核心作用是什么?

编程题:
1.用宏定义实现取两个数的最小值.

2.用预处理指令实现防止出现文件重复包含及交叉包含



